system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver           GAMG;
        tolerance        1E-5;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    p
    {
        $pcorr;
        tolerance        1E-6;
        relTol           0.001;
    }

    pFinal
    {
        $p;
        tolerance        1E-7;
        relTol           0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1E-6;
        relTol          0.01;
    }

    "(U|k|omega)Final"
    {
        $U;
        tolerance       1E-7;
        relTol          0;
    }

    cellDisplacement
    {
        solver          GAMG;
        tolerance       1E-6;
        relTol          0.01;
        smoother        GaussSeidel;
    }
    cellDisplacementFinal
    {
        $cellDisplacement;
        tolerance       1E-6;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi                yes;
    nOuterCorrectors          100;
    nCorrectors               10;
    nNonOrthogonalCorrectors  0;

    outerCorrectorResidualControl
    {
        p
        {
            tolerance        1E-3;
            relTol           0;
        }
    }

    residualControl
    {
        p             1E-4;
        U             1E-5;
        "(k|epsilon|omega|f|v2)" 1E-6;
    }
}

relaxationFactors
{
    fields
    {
        p                  0.3;
    }
    equations
    {
        "(U|k|omega)"      0.7;
        "(U|k|omega)Final" 1;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
